public class Main {
    public static void main(String[] args) {

    }/*
      Task 26
Есть телевизор (TV)

В телевизоре можно хранить набор каналов (Channel).
В каждом канале может быть набор передач (Program).

Есть пуль от телевизора (RemoteController).

Реализовать в пульте метод:

public void on(int channelNumber) - данный метод
позволит показать (напечатать в консоль) случайную передчу
канала с номером channelNumber

В main продемонстрировать работу программу


Был водитель, он связан с автобусом, а втобус с ним
Был автобус, у него были пассажиры.

Есть телевизор, он связан с пультом.

Есть телевизор, и в нем массив каналов.
Есть канал, а в канале массив программ.

remoteController.on(2)
  -> Tv
    -> Channel
      -> Program -> печатает свое название
        */

}