/* Напишите программу, которая выводит на экран информацию о вас
(или выдуманном персонаже) в три строчки:

"Меня зовут ..."
"Мне ... лет"
"Я из ..."
*/
public class Main {
    public static void main(String[] args) {
        System.out.println("Меня зовут Вадик");
        System.out.println("Мне 8 лет");
        System.out.println("Я из Киева");

        System.out.println("\nМеня зовут Вадик \nМне 8 лет \nЯ из Киева");
    }
}